## Задание 1
В первом задании необходимо было убрать все пустые строки. Я использовала формулу ^\s , где \s означает любой пробельный символ, а ^ — начало строки. Получается, я выделила все строки, начинающиеся с проблельных символов, и заменила их на пустоту, тем самым удалив их.  
## Задание 2
Во втором задании нужно было найти всех князей и города, имя и название которых оканчивается на "слав". Мной использовалось регулярное выражение: [А-ЯѢ]+[а-яѣ]+(слав)[а-яѣ]+  
- [А-ЯѢ]+ на первом месте означает, что слово должно начининаться с заглавной буквы, исключает использование не имен собственных.  
- [а-яѣ]+ означает любую последовательность букв нижнего регистра.  
- (слав) отмечает обязательное присутствие комбинации символов "слав" именно в такой последовательности
- [а-яѣ]+ добавляет условие дополнительных символов после последовательности "слав"
## Задание 3
В третьем задании нужно было найти все упоминания Новогорода. Я использовала регулярное выражение: (Нов)+.(город)[^W] , где указано обязательное присутствие комбинации символов "Нов" в определенном порядке, зачем ".", означающая любой символ, и затем комбинация "город"  
## БОНУС
Во-первых, я воспользовалась регуляркой [!,.;:"] (все знаки препинания) и сделала замену на \1 и пробел, поставив тем самым после каждого из перечисленных знака препринания пробел.  
Во-вторых, чтобы удовлетворить второму условию, я использовала "\[" с заменой на проблел и \1.  
В-третьих, я заменила ". . ." на "...", чтобы убрать пробелы после точки, когда после нее стоит другая точка.  
Наконец, я заменила несколько пробельных символов на один, чтобы поправить издержки предыдущих формул.  
